module.exports =  {
    is_recommend:{
        1:"是",
        2:"否"
    },
    /*内容管理*/
    cms_type_map:{
        1:"动态",
        2:"活动",
        3:"公告"
    },
    /*banner状态*/
    cms_state_map: {
        1: "发布",
        2: "禁用",
    },
    /*banner渠道*/
    channel_type: {
        1: "APP",
        2: "PC",
    },
    /*notice状态*/
    notice_state_type: {
        0: "未发布",
        1: "已发布",
        // 2: "已禁用",
    },
    /*证件类型*/
    identity_type_map: {
        1: "身份证",
        2: "军官证",
        3: "护照"
    },
    /*订单状态*/
    order_state: {
        1: "未支付",
        3: "已提交",
        2: "处理中",
        201: "已忽略",
        202: "已退回",
        203: "已取消",
        204: "已完成"
    },

    /** 线下入金 **/
    offline: {
        state:{
            1:"待审核",
            3:"审核通过",
            4:"审核拒绝",
        },
        cause:{
            10101:"线下充值",
            10201:"POS充值"
        }
    },
    /*入金订单类型*/
    deposit_order_state: {
        1: "未支付",
        204: "已完成",
//        3: "入金成功，变更余额失败"
    },
    /*出金订单类型*/
    withdraw_order_state: {
/*        1: "已提交",*/
        3: "已提交",
        2: "处理中",
        201: "已忽略",
        202: "已退回",
        203: "已取消",
        204: "已完成"
    },
    /*资金类型*/
    fund_type: {
        1: "入金 – 银行卡",
        2: "出金 – 银行卡",
        3: "利息",
        4: "佣金",
        5: "充值",
        10: "提成",
        20: "工资和奖金"
    },
    /*余额变化类型*/
    cause: {
        1: "投资_银行卡",
        2: "入金 – 微信",
        3: "入金 – 支付宝",
        4: "投资_余额",
        5:"提现退回",
        6:"活期赎回",
        7:"定期赎回",
        8:"充值_银行卡",
        101: "活期提现_银行卡",
        102: "投资_余额",
        105: "余额提现_银行卡",
        103: "活期赎回",
        104: "定期赎回",

        201: "活期利息",
        202: "定期利息",
        301: "活期佣金",
        302: "定期佣金",
        2001: "工资",
        2002: "奖金",
        1001:"提成",


        10101:"线下充值",
        10201:"POS充值",

    },
    /*余额变化类型  ====  old
    cause: {
        1: "入金 – 银行卡",
        2: "入金 – 微信",
        3: "入金 – 支付宝",
        4: "入金 – 出金退回",
        101: "出金 – 银行卡",
        201: "获得利息",
        301: "获得佣金",
        2001: "工资",
        2002: "奖金"
    },
    */

    //资金管理-余额变动-余额账户
    account_balance_cause: {
          8: "充值_银行卡",
        105: "余额提现_银行卡",
          5: "提现退回",
        102: "投资_余额",
          6: "活期赎回",
          7: "定期赎回",
        301: "活期佣金",
        302: "定期佣金",
        202: "定期利息",
        2001: "工资",
        2002: "奖金",
        10101:"线下充值",
        10201:"POS充值",

    },

    //资金管理-余额变动-活期账户
    current_balance_cause: {
          1: "投资_银行卡",
          4: "投资_余额",
        103: "活期赎回",
        101: "活期提现_银行卡",
          5: "提现退回",
        201: "活期利息",
    },

    //资金管理-余额变动-定期账户
    fix_balance_cause: {
        104: "定期赎回",
        1: "投资_银行卡",
        4: "投资_余额",

    },



    /*余额变化类型*/
    balance_cause: {
        1: "投资 – 银行卡",
        4: "投资 - 余额",
        5: "提现退回",
        6: "活期转入",
        7: "定期转余额",
        8: "充值",
        101: "提现 – 银行卡",
        102: "余额投资",
        103: "活期转余额",

        105: "提现",
        201: "活期利息",
        202: "定期利息",
        301: "活期佣金",
        302: "定期佣金",
        2001: "工资",
        2002: "奖金"
    },

    ding_balance_cause: {
        1: "投资 – 银行卡",
        4: "投资 - 余额",
        5: "提现退回",
        6: "活期转入",

        8: "充值",
        101: "提现 – 银行卡",
        102: "余额投资",
        103: "活期转余额",
        104: "定期转余额",
        105: "提现",
        201: "活期利息",
        202: "定期利息",
        301: "活期佣金",
        302: "定期佣金",
        2001: "工资",
        2002: "奖金"
    },


    /*
     余额变化类型 ====== old
    balance_cause: {
        1: "银行卡投资",
        8: "充值",
        6: "活期转入",
        4: "余额投资",
        7: "定期赎回",
        5: "提现退回",
        102: "余额投资",
        101: "提现",
        105: "提现",
        104: "定期赎回",
        103: "活期转余额",
        203: "定期利息",
        201: "活期利息",
        302: "活期佣金",
        303: "定期佣金",
        2001: "工资",
        2002: "奖金"

    },*/



    /*角色类型*/
    role_type: {
        1: "客户",
        3: "销售",
        11: "客服",
        12: "财务",
        13: "资金岗"
    },
    /*账户类型是否满足客户*/
    customer_type_satisfied: {
        1: "是",
        2: "否"
    },
    /*性别*/
    gender: {
        1: "男",
        2: "女",
    },
    /*证件类型*/
    identity_type: [
        {'value': '1', 'key': '身份证'},
        {'value': '3', 'key': '护照'}
    ],
    /* 行为日志类型 */
    operation: {
        login: {type: 0, label: "登录"},
        loginOut: {type: 1, label: "退出"},
        add: {type: 2, label: "新增"},
        eidt: {type: 3, label: "修改"},
        del: {type: 3, label: "删除"},
        setRole: {type: 3, label: "授权"},
        getList: {type: 3, label: "查询列表"},
        getId: {type: 3, label: "查询ID详情"},
    },
    /* 称呼 */
    gender: [
        {'value': '1', 'key': '先生'},
        {'value': '2', 'key': '女士'}
    ],
    /* 潜在代理状态 */
    potential_state: [
        {'value': '30', 'key': '未完成'},
        {'value': '31', 'key': '待审核'},
        {'value': '33', 'key': '已开户'},
        {'value': '32', 'key': '已拒绝'},
    ],
    /* 注册待审核代理 */
    status: [
        {'value': '31', 'key': '待审核'},
        {'value': '33', 'key': '已开户'},
        {'value': '32', 'key': '已拒绝'},
    ],
    potential_state_map: {
        30: '未完成',
        31: '待审核',
        33: '已开户',
        32: '已拒绝'
    },
    /* 代理账户状态 */
    account_state: [
        {'value': '1', 'key': '正常'},
        {'value': '2', 'key': '删除'},
        {'value': '50', 'key': '只读'},
        {'value': '51', 'key': '禁用'},
    ],

    account_type: [
        {'key': '余额账户', 'value': '1'},
        {'key': '活期资产', 'value': '2'},
        {'key': '定期资产', 'value': '3'}
    ],

    account_type: {
        1:"余额账户",
        2:"活期资产",
        3:"定期资产"
    },

    /* 沟通方式 */
    recorder_type: [
        {key: '电话', value: 1},
        {key: '邮件', value: 2},
        {key: '微信', value: 3},
        {key: '短信', value: 4},
        {key: '面谈', value: 5},
        {key: '其他', value: 6}
    ],

    /* 客户详情 资金着*/
    job: [        //就业情况
        {value: 1, key: '受雇'},
        {value: 2, key: '自雇'},
        {value: 3, key: '退休'},
        {value: 4, key: '失业'},
        {value: 5, key: '学生'},
        {value: 6, key: '家庭主妇'}
    ],
    job_map: {      //就业情况
        1: '受雇',
        2: '自雇',
        3: '退休',
        4: '失业',
        5: '学生',
        6: '家庭主妇'
    },
    capital_source: [        //资金来源
        {value: 1, key: '无资金来源'},
        {value: 2, key: '储蓄'},
        {value: 3, key: '退休金'},
        {value: 4, key: '政府援助'},
        {value: 5, key: '礼物馈赠'},
        {value: 6, key: '遗产继承'},
        {value: 7, key: '出售物业'},
        {value: 8, key: '出售/清算投资'}
    ],
    capital_source_map: {       //资金来源
        1: '无资金来源',
        2: '储蓄',
        3: '退休金',
        4: '政府援助',
        5: '礼物馈赠',
        6: '遗产继承',
        7: '出售物业',
        8: '出售/清算投资'
    },
    annual_income: [        //年收入
        {value: 1, key: '少于$25000'},
        {value: 2, key: '$25000-$49999'},
        {value: 3, key: '$50000-$99999'},
        {value: 4, key: '$100000-$249999'},
        {value: 5, key: '$250000-$1000000'},
        {value: 6, key: '多于$1000000'}
    ],
    annual_income_map: {       //年收入
        1: '少于$25000',
        2: '$25000-$49999',
        3: '$50000-$99999',
        4: '$100000-$249999',
        5: '$250000-$1000000',
        6: '多于$1000000'
    },
    total_asset: [        //总资产
        {value: 1, key: '少于$25000'},
        {value: 2, key: '$25000-$49999'},
        {value: 3, key: '$50000-$99999'},
        {value: 4, key: '$100000-$249999'},
        {value: 5, key: '$250000-$999999'},
        {value: 6, key: '$1000000-$4999999'},
        {value: 7, key: '$5000000-$9999999'},
        {value: 8, key: '多于$10000000'}
    ],
    total_asset_map: {      //总资产
        1: '少于$25000',
        2: '$25000-$49999',
        3: '$50000-$99999',
        4: '$100000-$249999',
        5: '$250000-$999999',
        6: '$1000000-$4999999',
        7: '$5000000-$9999999',
        8: '多于$10000000'
    },
    experience: [        //是否有交易经验
        {value: 1, key: '是'},
        {value: 2, key: '否'}
    ],
    experience_map: {      //是否有交易经验
        1: '是',
        2: '否'
    },
    assess_risk: [        //是否有评估风险能力
        {value: 1, key: '是'},
        {value: 2, key: '否'}
    ],
    assess_risk_map: {       //是否有评估风险能力
        1: '是',
        2: '否'
    },
    professional: [        //是否是专业人士
        {value: 1, key: '是'},
        {value: 2, key: '否'}
    ],
    professional_map: {        //是否是专业人士
        1: '是',
        2: '否'
    },

    /* 职位 */
    position: [
        {'value': '', 'key': '全部职位'},
        {'value': 3, 'key': '客户总监'},
        {'value': 2, 'key': '团队经理'},
        {'value': 1, 'key': '客户经理'},
    ],


    /* 职位 */
    puroduct_status: [
        {'value': '3', 'key': '客户总监'},
        {'value': '2', 'key': '团队经理'},
        {'value': '1', 'key': '客户经理'},
    ],


    /*---------------------------------------------------------------------------------*/
    /* 认证状态 (注册客户)*/
    auth_state: [

        {'value': '3', 'key': '已认证'},
        {'value': '1', 'key': '未认证'},
    ],
    auth_state_map: {
        1: '未认证',
        3: '已认证'
    },
    /* 银行是否默认 */
    is_default_map: {
        1: '正常',
        2: '已删除'
    },
    /* 银行状态 */
    band_state_map: {
        1: '正常',
        2: '已删除'
    },

    /* 销售列表 在岗状态*/
    sales_state: [
        {'value': 1, 'key': '在职'},
        {'value': 2, 'key': '离职'},
//        {'value': 3, 'key': '兼职'},
    ],
    new_sales_state: [//新增的销售不允许选择'离职'
        {'value': 1, 'key': '在职'},
//        {'value': 3, 'key': '兼职'},
    ],
    sales_state_map: {
        1: '在职',
        2: '离职',
        3: '兼职'
    },

    /* 入金信息 入金类型 */
    funds_cause: [
        {'value': '8', 'key': '充值_银行卡'},
        {'value': '1', 'key': '投资_银行卡'},
        {'value': '4', 'key': '投资_余额'},
        {'value': '10101', 'key': '线下充值'},
        {'value': '10201', 'key': 'POS充值'},

        // {'value': '2002', 'key': '奖金'}
    ],
    /* 入金信息 订单状态 */
    funds_order_status: [
        {'value': '1', 'key': '已提交'},
        {'value': '204', 'key': '已完成'},
        // {'value': '204', 'key': '已完成'}
    ],
    order_pay:{
        1: '入金 – 银行卡投资',
        4: '余额投资'
    },
    order_invest_pay_status:{
        3: '已支付',
        4: '已赎回'
    },
    order_invest_status: [
        {'value': '3', 'key': '已支付'},
        {'value': '4', 'key': '已赎回'}
    ],
    funds_order_status_map: {
        1: '未支付',
        2: '处理中',
        3: '已提交',
        201: '已忽略',
        202: '已退回',
        203: '已取消',
        204: '已完成',
        // 204: '已完成'
    },
    /* 出金信息 订单状态 */
    funds_withdraw_order_status: [
        {'value': '1', 'key': '未支付'},
        {'value': '2', 'key': '处理中'},
        {'value': '3', 'key': '已提交'},
        {'value': '201', 'key': '已忽略'},
        {'value': '202', 'key': '已退回'},
        {'value': '203', 'key': '已取消'},
        {'value': '204', 'key': '已完成'}
    ],
  /*  funds_withdraw_order_status_map: {
        1: '已提交',
        2: '处理中',
        201: '已忽略',
        202: '已退回',
        203: '已取消',
        204: '已完成'
    },*/
    /* 销售职位 */
    sales_position: [
        {'value': '', 'key': '全部职位'},
        {'value': 3, 'key': '客户经理'},
        {'value': 2, 'key': '团队经理'},
        {'value': 1, 'key': '销售总监'},
    ],
    sales_position_dic: {
        3: "客户经理",
        2: "团队经理",
        1: "销售总监"
    },


    /* 工资奖金管理------------------------ */
    /*发放类型*/
    wages_type: {
        1: '对私工资',
        2: '会员奖金'
    },
    /*发放状态*/
    wages_status: {
        1: '未发放',
        2: '发放成功',
        3: '发放失败'
    },
    /*执行结果*/
    operation_state: {
        1: '操作成功',
        2: '操作失败'
    },
    /*操作类型*/
    operation_type: {
        1: '执行发放',
        2: '导入文件'
    },
    /*错误类型*/
    wages_err_code: {
        1: '证件号码不存在',
        2: '证件号码与姓名不匹配',
        3: '证件号码不能为空',
        4: '姓名不能为空',
        5: '金额不能为空',
        6: '金额格式有误',
        7: '数据有重复',
        8: '无对应产品',
        9: '无对应投资',
        10: '插入数据库失败'
    },

    log_type: {
        0: '登录',
        1: '退出',
        2: '新增',
        3: '修改',
        4: '删除',
        5: '授权',
        6: '查询列表',
        7: '查询ID详情',
        8: '踢出用户'
    },
    profit_type: {
        1: '按日计息',
        10: '到期还本付息',
        5: '按月付息',

    },
    /* 工资奖金管理------------------------ */
    /*发放类型*/
    operator_type: {
        1: '新增标星',
        2: '取消标星'
    },
}

